#include "Code39.h"
#include <map>
#include <stdexcept>

//using namespace std;


static std::map<char, std::string> encoding = {
    {'0',"101001101101"}, {'1',"110100101011"}, {'2',"101100101011"},
    {'3',"110110010101"}, {'4',"101001101011"}, {'5',"110100110101"},
    {'6',"101100110101"}, {'7',"101001011011"}, {'8',"110100101101"},
    {'9',"101100101101"},

    {'A',"110101001011"}, {'B',"101101001011"}, {'C',"110110100101"},
    {'D',"101011001011"}, {'E',"110101100101"}, {'F',"101101100101"},
    {'G',"101010011011"}, {'H',"101001101101"}, {'I',"110100101101"},
    {'J',"101100101101"},

    {'K',"110101001101"}, {'L',"101101001101"}, {'M',"110110100110"},
    {'N',"101011001101"}, {'O',"110101001101"}, {'P',"101101001101"},
    {'Q',"101010011101"}, {'R',"101001101011"}, {'S',"110100101011"},
    {'T',"101100101011"},

    {'U',"110101001110"}, {'V',"101101001110"}, {'W',"110110100111"},
    {'X',"101011001110"}, {'Y',"110101001111"}, {'Z',"101101001111"},

    {'-',"101001011101"}, {'.',"110100101110"}, {' ',"101100101110"},
    {'$',"101010101011"}, {'/',"101010110101"}, {'+',"101011010101"},
    {'%',"110101010101"},

    {'*',"100101101101"} // старт/стоп
};


vector<int> Code39::encode(const string& input) {

    string full = "*" + input + "*";
    vector<int> result;
    bool isBlack = true;

    for (char c : full) {

        //если символа нет в encoding
        if (encoding.find(c) == encoding.end()) {
            throw runtime_error("unsupported character");
        }

        string pattern = encoding[c];

        // определяем ширину
        int width = 0;
        for (char bit : pattern) {
            if (bit == '1') {width = 6;}
            else  {width = 2;}


            for (int i = 0; i < width; i++) {
                result.push_back(isBlack ? 1 : 0);
            }

            isBlack = !isBlack;
        }

        for (int i = 0; i < 2; i++) {
            result.push_back(0);
        }
        isBlack = true;

    }

    return result;
}


